''''''
'''
题目描述:
小蓝给学生们组织了一场考试，卷面总分为100分，每个学生的得分都是一个0到100的整数。如果得分至少是60分，则称为及格。如果得分至少为85分，则称为优秀。
请计算及格率和优秀率，用百分数表示，百分号前的部分四舍五入保留整数。
输入描述:
输入的第一行包含一个整数n (1 ≤ n ≤ 10^4)，表示考试人数。接下来n行，每行包含一个0至100的整数，表示一个学生的得分。
输出描述:
输出两行，每行一个百分数，分别表示及格率和优秀率。百分号前的部分四舍五入保留整数。
'''
n = int(input())
pass_num = 0
super_num = 0
for i in range(n):
    tmp = int(input())
    if tmp >= 60:
        pass_num += 1
        if tmp >= 85:
            super_num += 1
print('{:.0%}'.format(pass_num/n))
print('{:.0%}'.format(super_num/n))
